---
kind: property
id: P:Autodesk.Revit.DB.SharedParameterApplicableRule.ParameterName
source: html/2392a8da-efd4-3571-4cc6-cae5e05d3d02.htm
---
# Autodesk.Revit.DB.SharedParameterApplicableRule.ParameterName Property

The name of the parameter that an element must support to pass this rule.

## Syntax (C#)
```csharp
public string ParameterName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null